[
    {
        "logo": "/education/logoVonBraun.jpeg",
        "institution": "Von Braun Labs",
        "course": "Full Stack Developer",
        "date": "Dec 2024 - present",
        "description": "Worked on the development and maintenance of the ChipInventor platform, focusing on full-stack tasks. On the back end, created and maintained CRUDs, fixed bugs, and refactored legacy PHP code. On the front end, redesigned pages using HTML, CSS, Bootstrap, and JavaScript. Built dashboards and interactive components integrated with the backend. Used GitHub for version control and supported deployment testing.",
        "link": "",
        "technologies": [
            "PHP",
            "HTML",
            "CSS",
            "Bootstrap",
            "JavaScript",
            "GitHub"
        ]
    },
    {
        "logo": "/education/logoUFU.png",
        "institution": "X-RAT - UFU",
        "course": "Full Stack Developer",
        "date": "Feb 2024 - present",
        "description": "Development of a Full Stack system for automatic generation of operating system reliability reports, using Python with FastAPI on the backend and React with PostgreSQL on the frontend.",
        "link": "",
        "technologies": [
            "Python",
            "FastAPI",
            "PostgreSQL",
            "React"
        ]
    },
    {
        "logo": "/education/logoWorkana.png",
        "institution": "Freelancer",
        "course": "Web Developer",
        "date": "2023 - 2024",
        "description": "Developed institutional and professional websites using Next.js, NextAuth, PostgreSQL, Tailwind CSS, and Shadcn UI. Responsible for requirements gathering, development, deployment, and maintenance. Projects included websites for a psychology clinic, an academic lab, and an invitation company.",
        "link": "",
        "technologies": [
            "Next.js",
            "NextAuth",
            "PostgreSQL",
            "TailwindCSS",
            "Shadcn UI"
        ]
    },
    {
        "logo": "/education/logoUFU.png",
        "institution": "UFU",
        "course": "Web Programming Instructor",
        "date": "Jun 2024 - Dec 2024",
        "description": "Taught web development to teenagers, covering basic computer skills through to website creation with HTML, CSS, and an introduction to Bootstrap. At the end of the course, students delivered their own websites as final projects.",
        "link": "",
        "technologies": [
            "HTML",
            "CSS",
            "Bootstrap"
        ]
    }
]